gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Mettre à jour le paramètre
  parameters[7].value = (uint8_t)transposedGateThreshold;
  dmxValues[parameters[7].dmxChannel - 1] = (uint8_t)transposedGateThreshold;
  
  // Debug
  Serial.print("Gate threshold ajusté: ");
  Serial.print(originalGateThreshold);
  Serial.print(" + (");
  Serial.print(transpose);
  Serial.print(" × ");
  Serial.print(transpose_factor);
  Serial.print(") = ");
  Serial.print(transposedGateThreshold);
  Serial.print(" (DMX canal ");
  Serial.print(parameters[7].dmxChannel);
  Serial.print(", index DMX ");
  Serial.print(parameters[7].dmxChannel - 1);
  Serial.println(")");
}

// Fonction pour appliquer l'octave web directement aux paramètres sensibles
void applyWebOctave() {
  if (selectedPreset == 0 && webModeActive) {
    // Appliquer l'octave au pitch (paramètre 1)
    int pitchValue = (int)parameters[1].value + (webOctave * transpose_factor);
    if (pitchValue < 0) pitchValue = 0;
    if (pitchValue > 255) pitchValue = 255;
    dmxValues[parameters[1].dmxChannel - 1] = (uint8_t)pitchValue;
    
    // Appliquer l'octave au gate_threshold (paramètre 7)
    int gateValue = (int)parameters[7].value + (webOctave * transpose_factor);
    if (gateValue < 0) gateValue = 0;
    if (gateValue > 255) gateValue = 255;
    dmxValues[parameters[7].dmxChannel - 1] = (uint8_t)gateValue;
    
    // Debug supprimé pour améliorer les performances
  }
}

// Fonction pour obtenir la valeur d'un paramètre par son nom
uint8_t getParameter(const char* paramName) {
  for (int i = 0; i < PRESET_SIZE; i++) {
    if (strcmp(parameters[i].name, paramName) == 0) {
      return parameters[i].value;
    }
  }
  return 0;
}

// Variables globales pour stocker les liens des contrôles physiques
// REMOVED: Les liens sont maintenant lus dynamiquement depuis le preset actuel

// Fonction pour mettre à jour les liens des contrôles physiques depuis le preset actuel
// REMOVED: Plus nécessaire car les liens sont lus à chaque appel

// Fonction pour sauvegarder un preset
void savePreset(uint8_t presetIndex, const char* presetName) {
  if (presetIndex >= MAX_PRESETS) {
    Serial.println("Index de preset invalide");
    return;
  }
  
  // Copier le nom du preset
  strncpy(presets[presetIndex].name, presetName, 15);
  presets[presetIndex].name[15] = '\0';
  
  // Copier les valeurs des paramètres
  for (int i = 0; i < PRESET_SIZE; i++) {
    presets[presetIndex].values[i] = parameters[i].value;
  }
  
  //Serial.println("Preset " + String(presetIndex) + " sauvegardé en RAM: " + String(presetName));
}

// Fonction pour charger un preset
void loadPreset(uint8_t presetIndex) {
  if (presetIndex >= MAX_PRESETS) {
    Serial.println("Index de preset invalide");
    return;
  }
  
  // Appliquer les valeurs aux paramètres
  for (int i = 0; i < PRESET_SIZE; i++) {
    parameters[i].value = presets[presetIndex].values[i];
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  
  // Les liens des contrôles physiques sont maintenant lus dynamiquement à chaque appel
  
  Serial.println("Preset " + String(presetIndex) + " chargé: " + String(presets[presetIndex].name));
}

// Fonction pour afficher tous les paramètres
void printParameters() {
  //Serial.println("=== Paramètres actuels ===");
  for (int i = 0; i < PRESET_SIZE; i++) {
    //Serial.println(String(parameters[i].name) + " (DMX " + String(parameters[i].dmxChannel) + "): " + String(parameters[i].value));
  }
  //Serial.println("==========================");
}

// Fonction pour initialiser les paramètres par défaut
void initializeParameters() {
  for (int i = 0; i < PRESET_SIZE; i++) {
    parameters[i].value = parameters[i].defaultValue;
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  //Serial.println("Paramètres initialisés aux valeurs par défaut");
}



// Fonction pour enregistrer tous les paramètres d'un coup (40 arguments)
void setAllParameters(
uint8_t autopan_depth,   // 0
uint8_t pitch,          // 1
uint8_t vibrato_speed,  // 2
uint8_t vibrato_depth,  // 3  
uint8_t delay_time,     // 4
uint8_t delay_feedback, // 5
uint8_t osc_waveform,  // 6
uint8_t gate_threshold, // 7
uint8_t portamento_time, // 8
uint8_t scale,          // 9
uint8_t octave_low_high, // 10
uint8_t osc2_volume,    // 11
uint8_t osc2_pitch_offset, // 12
uint8_t autopan_frequency, // 13
uint8_t scale_tonic, // 14
uint8_t volume_drums, // 15
uint8_t trig_kick, // 16
uint8_t trig_snare, // 17
uint8_t trig_hh, // 18
uint8_t master_volume, // 19
uint8_t filter_on_off, // 20
uint8_t filter_cutoff, // 21
uint8_t filter_reso, // 22
uint8_t filter_type, // 23
                     // Nouveaux paramètres
uint8_t ir1_target_param, // 24
uint8_t ir2_target_param, // 25
uint8_t fader1_target_param, // 26
uint8_t fader2_target_param, // 27
uint8_t fader3_target_param, // 28
uint8_t button3_target_param, // 29
uint8_t button3_released_value, // 30
uint8_t button3_pressed_value, // 31
uint8_t rgb1_red, // 32
uint8_t rgb1_green, // 33
uint8_t rgb1_blue, // 34
uint8_t rgb2_red, // 35
uint8_t rgb2_green, // 36
uint8_t rgb2_blue, // 37
uint8_t dimmer1_source, // 38
uint8_t dimmer2_source) { // 39
  
  // Mettre à jour tous les paramètres existants (0-23)
  parameters[0].value = autopan_depth;
  parameters[1].value = pitch;
  parameters[2].value = vibrato_speed;
  parameters[3].value = vibrato_depth;
  parameters[4].value = delay_time;
  parameters[5].value = delay_feedback;
  parameters[6].value = osc_waveform;
  parameters[7].value = gate_threshold;
  parameters[8].value = portamento_time;
  parameters[9].value = scale;
  parameters[10].value = octave_low_high;
  parameters[11].value = osc2_volume;
  parameters[12].value = osc2_pitch_offset;
  parameters[13].value = autopan_frequency;
  parameters[14].value = scale_tonic;
  parameters[15].value = volume_drums;
  parameters[16].value = trig_kick;
  parameters[17].value = trig_snare;
  parameters[18].value = trig_hh;
  parameters[19].value = master_volume;
  parameters[20].value = filter_on_off;
  parameters[21].value = filter_cutoff;
  parameters[22].value = filter_reso;
  parameters[23].value = filter_type;
  
  // Mettre à jour les nouveaux paramètres (24-39)
  parameters[24].value = ir1_target_param;
  parameters[25].value = ir2_target_param;
  parameters[26].value = fader1_target_param;
  parameters[27].value = fader2_target_param;
  parameters[28].value = fader3_target_param;
  parameters[29].value = button3_target_param;
  parameters[30].value = button3_released_value;
  parameters[31].value = button3_pressed_value;
  parameters[32].value = rgb1_red;
  parameters[33].value = rgb1_green;
  parameters[34].value = rgb1_blue;
  parameters[35].value = rgb2_red;
  parameters[36].value = rgb2_green;
  parameters[37].value = rgb2_blue;
  parameters[38].value = dimmer1_source;
  parameters[39].value = dimmer2_source;
  
  // Mettre à jour le tableau DMX
  for (int i = 0; i < PRESET_SIZE; i++) {
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  
