gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// Fonction pour lire les faders
void readFaders() {
  faderValues[0] = analogRead(FADER_1_PIN) / 16; // 0-4095 -> 0-255
  faderValues[1] = analogRead(FADER_2_PIN) / 16;
  faderValues[2] = analogRead(FADER_3_PIN) / 16;
  
  // Mise à jour des paramètres selon les faders
  if (faderValues[0] != lastFaderValues[0]) {
    setParameter("filter_cutoff", faderValues[0]);
    lastFaderValues[0] = faderValues[0];
  }
  
  if (faderValues[1] != lastFaderValues[1]) {
    setParameter("filter_reso", faderValues[1]);
    lastFaderValues[1] = faderValues[1];
  }
  
  if (faderValues[2] != lastFaderValues[2]) {
    setParameter("delay_time", faderValues[2]);
    lastFaderValues[2] = faderValues[2];
  }
}

// Fonction pour gérer les boutons push
void handleButtons() {
  // Lecture des boutons
  bool button1State = !digitalRead(BUTTON_1_PIN); // Inversé car INPUT_PULLUP
  bool button2State = !digitalRead(BUTTON_2_PIN);
  bool button3State = !digitalRead(BUTTON_3_PIN);
  
  // Bouton 1 - Déclencher trig_kick (paramètre 17, canal DMX 117)
  if (button1State && !lastButtonStates[0] && (millis() - lastButtonPress[0] > BUTTON_DEBOUNCE)) {
    dmxValues[116] = 255; // Canal DMX 117 (index 116)
    //Serial.println("Bouton 1 - Trig Kick déclenché");
    lastButtonPress[0] = millis();
  }
  lastButtonStates[0] = button1State;
  
  // Bouton 2 - Déclencher trig_snare (paramètre 18, canal DMX 118)
  if (button2State && !lastButtonStates[1] && (millis() - lastButtonPress[1] > BUTTON_DEBOUNCE)) {
    dmxValues[117] = 255; // Canal DMX 118 (index 117)
    //Serial.println("Bouton 2 - Trig Snare déclenché");
    lastButtonPress[1] = millis();
  }
  lastButtonStates[1] = button2State;
  
  // Bouton 3 - Charger preset 2
  if (button3State && !lastButtonStates[2] && (millis() - lastButtonPress[2] > BUTTON_DEBOUNCE)) {
    //dmxValues[116] = 255; // KICK
    //Serial.println("Bouton 3 - Preset 2 chargé");
    lastButtonPress[2] = millis();
  }
  lastButtonStates[2] = button3State;
}


// Fonction pour gérer les boutons avec interruptions
void handleButtonInterrupts() {
  // Traiter les interruptions du bouton 1 (décrémenter transposition)
  if (buttonInterruptFlags[0]) {
    // Ne pas traiter la transposition en mode web (preset 0)
    if (selectedPreset != 0 && transpose > -12) {
      transpose--;
      Serial.print("Bouton 1 - Transposition décrémentée: ");
      Serial.println(transpose);
      
      // Afficher immédiatement la nouvelle transposition
      displayUnified();
      
      // Recharger le preset pour appliquer la nouvelle transposition
      loadPreset(selectedPreset);
      
      // Mettre à jour le gate_threshold avec la nouvelle transposition
      updateGateThresholdWithTranspose();
    } else if (selectedPreset == 0) {
      Serial.println("Bouton 1 - Transposition désactivée en mode web");
    }
    buttonInterruptFlags[0] = false;
  }
  
  // Traiter les interruptions du bouton 2 (incrémenter transposition)
  if (buttonInterruptFlags[1]) {
    // Ne pas traiter la transposition en mode web (preset 0)
    if (selectedPreset != 0 && transpose < 12) {
      transpose++;
      Serial.print("Bouton 2 - Transposition incrémentée: ");
      Serial.println(transpose);
      
      // Afficher immédiatement la nouvelle transposition
      displayUnified();
      
      // Recharger le preset pour appliquer la nouvelle transposition
      loadPreset(selectedPreset);
      
      // Mettre à jour le gate_threshold avec la nouvelle transposition
      updateGateThresholdWithTranspose();
    } else if (selectedPreset == 0) {
      Serial.println("Bouton 2 - Transposition désactivée en mode web");
    }
    buttonInterruptFlags[1] = false;
  }
  
  // Traiter les interruptions du bouton 3 (trig_hh)
  if (buttonInterruptFlags[2]) {
    dmxValues[118] = TRIG_LENGTH; // Canal DMX 119 (trig_hh)
    Serial.println("Bouton 3 - Trig HH déclenché (ISR) - Durée: " + String(TRIG_LENGTH));
    buttonInterruptFlags[2] = false;
  }
}


// Fonction pour charger un preset web dans les paramètres physiques
void loadWebPresetToPhysical(int presetId) {
  if (presetId < 1 || presetId > MAX_WEB_PRESETS) {
    Serial.println("ID de preset web invalide: " + String(presetId));
    return;
  }
  
  // Charger les données du preset web depuis la mémoire
  // Vérifier si le preset a un nom (= il a été sauvegardé)
  if (strlen(webPresets[presetId - 1].name) > 0) {
    // Appliquer les 27 paramètres du preset web aux paramètres physiques
    for (int i = 0; i < 27 && i < PRESET_SIZE; i++) {
      parameters[i].value = webPresets[presetId - 1].values[i];
      dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
    }
    
    // Appliquer l'octave web
    webOctave = webPresets[presetId - 1].octave;
    applyWebOctave();
    
    // Activer le mode web pour pouvoir utiliser l'octave
    webModeActive = true;
    
    Serial.println("Preset web " + String(presetId) + " (" + String(webPresets[presetId - 1].name) + ") chargé (octave: " + String(webOctave) + ")");
  } else {
    Serial.println("Preset web " + String(presetId) + " vide, utilisation des valeurs par défaut");
    // Charger des valeurs par défaut
    for (int i = 0; i < PRESET_SIZE; i++) {
      parameters[i].value = 0;
      dmxValues[parameters[i].dmxChannel - 1] = 0;
    }
    webOctave = 0;
    webModeActive = true;
  }
}

// Fonction pour gérer l'encodeur KY-040
void handleEncoder() {
  int32_t currentEncoderValue = - encoder.getCount();
  
  // Calculer le preset selon la formule : |valeur_encoder / 2| % 9 (0-8)
  // Preset 0 = mode web, presets 1-8 = presets web sauvegardés
  int32_t normalizedValue = abs(currentEncoderValue / 2);
  uint8_t newPreset = normalizedValue % 9; // 0 à 8 au lieu de 0 à 9
  
  // Si le preset a changé
  if (newPreset != selectedPreset) {
    // Sauvegarder l'état web si on quitte le preset 0
    if (selectedPreset == 0 && webModeActive) {
      saveWebStateToPreset0();
    }
    
    selectedPreset = newPreset;
    
    // Réinitialiser la transposition lors du changement de preset
    transpose = 0;
    
    // Charger le preset sélectionné
    if (selectedPreset == 0) {
      // Preset 0 : mode web
      resetWebParameters();
    } else {
      // Presets 1-8 : charger les presets web depuis LittleFS
      loadWebPresetToPhysical(selectedPreset);
    }
    
