gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
    // Pas besoin d'updateGateThresholdWithTranspose() car transpose = 0
    
    // Afficher le nouveau preset avec transposition réinitialisée
    displayUnified();
    
    // Debug sur le moniteur série
    Serial.print("Preset changé: ");
    Serial.print(selectedPreset);
    if (selectedPreset == 0) {
      Serial.println(" - WEB MODE");
    } else {
      Serial.print(" - Preset web ");
      Serial.println(selectedPreset);
    }
    Serial.println("Transposition réinitialisée à 0");
  }
  
  // Gestion du bouton de l'encodeur (toggle filtre)
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);
  if (encoderButtonState && !encoderButtonPressed && (millis() - lastEncoderButtonPress > BUTTON_DEBOUNCE)) {
    uint8_t currentFilterState = getParameter("filter_on_off");
    uint8_t newFilterState = (currentFilterState == 0) ? 255 : 0;
    setParameter("filter_on_off", newFilterState);
    
    // Afficher temporairement l'état du filtre
    display.clear();
    if (newFilterState == 255) {
      display.showNumberDec(9999); // Afficher "9999" pour indiquer FILTRE ON
    } else {
      display.showNumberDec(0);    // Afficher "0000" pour indiquer FILTRE OFF
    }
    
    Serial.print("Filtre: ");
    Serial.println((newFilterState == 255) ? "ON" : "OFF");
    
    // Attendre 500ms puis revenir à l'affichage unifié
    delay(500);
    displayUnified();
    
    encoderButtonPressed = true;
    lastEncoderButtonPress = millis();
  }
  
  if (!encoderButtonState) {
    encoderButtonPressed = false;
  }
}

// Fonction pour afficher la transposition et le preset de manière unifiée
void displayUnified() {
  // Format: TTPP où TT = transposition/octave (-12 à +12) et PP = preset (0-9)
  // Exemples: 
  // - Transposition +5, preset 3 → "0503" 
  // - Transposition -2, preset 7 → "-207"
  // - Octave web +3, preset 0 → "0300"
  
  uint8_t segments[4] = {0, 0, 0, 0};
  
  // Choisir entre transposition physique et octave web
  int8_t displayValue = (selectedPreset == 0 && webModeActive) ? webOctave : transpose;
  
  // Calcul pour les digits de la transposition/octave (positions 0 et 1)
  if (displayValue == 0) {
    // Valeur = 0 : afficher "00"
    segments[0] = display.encodeDigit(0);
    segments[1] = display.encodeDigit(0);
  } else if (displayValue > 0) {
    // Valeur positive : afficher directement le nombre
    if (displayValue >= 10) {
      segments[0] = display.encodeDigit(displayValue / 10);
      segments[1] = display.encodeDigit(displayValue % 10);
    } else {
      segments[0] = display.encodeDigit(0);
      segments[1] = display.encodeDigit(displayValue);
    }
  } else {
    // Valeur négative : afficher "-" + valeur absolue
    segments[0] = 0x40; // Segment "-"
    int absValue = -displayValue;
    if (absValue >= 10) {
      segments[1] = display.encodeDigit(absValue / 10);
    } else {
      segments[1] = display.encodeDigit(absValue);
    }
  }
  
  // Calcul pour les digits du preset (positions 2 et 3)
  segments[2] = display.encodeDigit(0); // Toujours 0 car preset va de 0 à 8
  segments[3] = display.encodeDigit(selectedPreset);
  
  // Afficher les segments
  display.setSegments(segments);
}

// Fonction pour mettre à jour l'afficheur TM1637
void updateDisplay() {
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {
    // Utiliser la nouvelle fonction d'affichage unifiée
    displayUnified();
    lastDisplayUpdate = millis();
  }
}

void setup()
{
  Serial.begin(115200);
  Serial.println("=== Contrôleur Interactif ESP32 ===");
  Serial.println("Initialisation...");
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques
  btStop();
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");
  
  // Afficher l'adresse MAC de l'ESP32
  Serial.print("Adresse MAC ESP32: ");
  Serial.println(WiFi.macAddress());
  
  // Initialisation du tableau DMX à 0
  for (int i = 0; i < 512; i++) {
    dmxValues[i] = 0;
  }
  
  // Initialisation des paramètres
  initializeParameters();
  
  // Initialisation des presets
  initializePresets();
  
  // Chargement du preset 1 au démarrage
  loadPreset(1);
  selectedPreset = 1; // S'assurer que selectedPreset est correct
  
  // Initialisation de l'interface utilisateur
  initializeUserInterface();
  
  // Affichage initial unifié
  displayUnified();
  
  // Configuration ESP-NOW
  WiFi.mode(WIFI_STA);
  
  if (esp_now_init() != ESP_OK) {
    Serial.println("Erreur d'initialisation ESP-NOW");
    return;
  }
  
  esp_now_register_send_cb(OnDataSent);

  
  // Configuration du peer récepteur ESP8266 (unicast au lieu de broadcast)
  memcpy(peerInfo.peer_addr, receiverAddress, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    Serial.println("Erreur d'ajout du peer");
    return;
  }
  

  
  Serial.println("ESP-NOW initialisé");
  Serial.println("Mode: Unicast vers récepteur ESP8266");
  Serial.print("Adresse MAC cible: ");
  for (int i = 0; i < 6; i++) {
    Serial.print(receiverAddress[i], HEX);
    if (i < 5) Serial.print(":");
  }
  Serial.println();
  
  // Initialisation de l'interface web
  setupWebInterface();
  

  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");
  Serial.println("  Format d'affichage: TTPP (TT=transposition, PP=preset)");
  Serial.println("  Exemples: 0501=transpose +5/preset 1, -203=transpose -2/preset 3");
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");
  Serial.println("Bouton 1: Décrémenter transposition (-12 à +12)");
  Serial.println("Bouton 2: Incrémenter transposition (-12 à +12)");
  Serial.println("Bouton 3: Trig HH");
  Serial.println("Bouton encodeur: Toggle filtre ON/OFF");

  Serial.println("Transposition actuelle: " + String(transpose) + " (×" + String(transpose_factor) + ")");
  Serial.println("Transposition appliquée au pitch et gate_threshold");
  Serial.println("================================");
}

void sendDMXvalues()
{
  // Envoi des 4 paquets DMX (512 canaux divisés en 4 blocs de 128)
  for (int packetNumber = 0; packetNumber < 4; packetNumber++)
  {
    outgoingDMXPacket.blockNumber = packetNumber;
    
    // Remplir le paquet avec les 128 valeurs correspondantes
    for (int i = 0; i < 128; i++)
    {
      int dmxIndex = (packetNumber * 128) + i;
      if (dmxIndex < 512) {
        outgoingDMXPacket.dmxvalues[i] = dmxValues[dmxIndex];
      } else {
        outgoingDMXPacket.dmxvalues[i] = 0;
      }
    }
    
    // Envoi du paquet via ESP-NOW
    esp_err_t result = esp_now_send(receiverAddress, (uint8_t *)&outgoingDMXPacket, sizeof(outgoingDMXPacket));
    
    if (result == ESP_OK) {
      //Serial.print(" [OK]");
    } else {
      Serial.print(" [ERREUR]");
    }
  }
  
  // Décrémenter les canaux trig_kick, trig_snare et trig_hh après l'envoi
  if (dmxValues[116] > 0) dmxValues[116]--; // Canal DMX 117 (trig_kick)
  if (dmxValues[117] > 0) dmxValues[117]--; // Canal DMX 118 (trig_snare)
  if (dmxValues[118] > 0) dmxValues[118]--; // Canal DMX 119 (trig_hh)
  
  //Serial.println();
}

