gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
        JsonArray valuesArray = preset["values"];
        int i = 0;
        for (JsonVariant value : valuesArray) {
          if (i < 27) {
            webPresets[slot].values[i] = value;
            i++;
          }
        }
        
        // Mettre à jour webPresetCount si nécessaire
        if (slot >= webPresetCount) {
          webPresetCount = slot + 1;
        }
      }
    }
    
    Serial.print("📂 ");
    Serial.print(webPresetCount);
    Serial.println(" presets web chargés");
  } else {
    Serial.println("🔍 DEBUG: Impossible d'ouvrir le fichier");
  }
  Serial.println("🔍 DEBUG: Sortie de loadWebPresets()");
}

// Sauvegarde des assignations dans LittleFS
void saveWebAssignments() {
  File file = LittleFS.open("/web_assignments.json", "w");
  if (file) {
    DynamicJsonDocument doc(512);
    JsonArray assignmentsArray = doc.createNestedArray("assignments");
    
    for (int i = 0; i < 4; i++) {
      assignmentsArray.add(webAssignments[i]);
    }
    
    serializeJson(doc, file);
    file.close();
    Serial.println("💾 Assignations web sauvegardées");
  }
}

// Chargement des assignations depuis LittleFS
void loadWebAssignments() {
  // Vérifier d'abord si le fichier existe
  if (!LittleFS.exists("/web_assignments.json")) {
    Serial.println("🔗 Aucune assignation web trouvée (première utilisation)");
    // Initialiser avec des valeurs par défaut (tout à OFF)
    for (int i = 0; i < 4; i++) {
      webAssignments[i] = 0;
    }
    return;
  }
  
  File file = LittleFS.open("/web_assignments.json", "r");
  if (file) {
    DynamicJsonDocument doc(512);
    deserializeJson(doc, file);
    file.close();
    
    JsonArray assignmentsArray = doc["assignments"];
    int i = 0;
    for (JsonVariant value : assignmentsArray) {
      if (i < 4) {
        webAssignments[i] = value;
        i++;
      }
    }
    
    Serial.println("📂 Assignations web chargées");
  }
}

// Sauvegarde de l'état web actuel dans le preset 0
void saveWebStateToPreset0() {
  if (webModeActive) {
    // Sauvegarder les 21 paramètres audio principaux dans le preset 0
    for (int i = 0; i < 21; i++) {
      presets[0].values[i] = parameters[i].value;
    }
    
    // Sauvegarder les assignations
    presets[0].values[24] = webAssignments[0]; // IR1
    presets[0].values[25] = webAssignments[1]; // IR2
    presets[0].values[27] = webAssignments[2]; // Fader2
    presets[0].values[28] = webAssignments[3]; // Fader3
    
    Serial.println("💾 État web sauvegardé dans le preset 0");
  }
}

// Chargement de l'état web depuis le preset 0
void loadWebStateFromPreset0() {
  // Charger les 21 paramètres audio principaux depuis le preset 0
  for (int i = 0; i < 21; i++) {
    parameters[i].value = presets[0].values[i];
    dmxValues[parameters[i].dmxChannel - 1] = presets[0].values[i];
  }
  
  // Charger les assignations
  webAssignments[0] = presets[0].values[24]; // IR1
  webAssignments[1] = presets[0].values[25]; // IR2
  webAssignments[2] = presets[0].values[27]; // Fader2
  webAssignments[3] = presets[0].values[28]; // Fader3
  
  // Sauvegarder les assignations web
  saveWebAssignments();
  
  Serial.println("📂 État web chargé depuis le preset 0");
}

// Fonction pour réinitialiser les paramètres web quand on revient au preset 0
void resetWebParameters() {
  // Si on revient au preset 0, charger le dernier preset web utilisé
  if (lastWebPreset >= 0 && lastWebPreset < webPresetCount) {
    // Charger le dernier preset web
    for (int i = 0; i < 21; i++) {
      parameters[i].value = webPresets[lastWebPreset].values[i];
      dmxValues[parameters[i].dmxChannel - 1] = webPresets[lastWebPreset].values[i];
    }
    Serial.println("🔄 Paramètres web réinitialisés depuis le dernier preset: " + String(lastWebPreset));
  } else {
    // Sinon, utiliser les valeurs du preset 0
    loadWebStateFromPreset0();
  }
}

// Gestion des contrôles physiques en mode web
void handleWebPhysicalControls() {
  updateRGBWithDimmer();
  // Vérifier s'il y a des assignations actives
  bool hasActiveAssignments = false;
  for (int i = 0; i < 4; i++) {
    if (webAssignments[i] > 0 && webAssignments[i] <= 21) {
      hasActiveAssignments = true;
      break;
    }
  }
  
  // Si aucune assignation active, ne rien faire
  if (!hasActiveAssignments) {
    return;
  }
  
  // Lecture stabilisée des capteurs IR
  int stabilizedIR1 = readStabilizedIRSensor(DIST_SENSOR_1_PIN, irBuffer1, irIndex1, irSum1, irInitialized1);
  int stabilizedIR2 = readStabilizedIRSensor(DIST_SENSOR_2_PIN, irBuffer2, irIndex2, irSum2, irInitialized2);
  uint8_t ir1Value = mapIR1Logarithmic(stabilizedIR1);
  uint8_t ir2Value = stabilizedIR2 / 16;
  
  // Lecture des faders
  uint8_t fader2Value = (4095 - analogRead(FADER_2_PIN)) / 16;
  uint8_t fader3Value = (4095 - analogRead(FADER_3_PIN)) / 16;
  
  // IR1
  if (webAssignments[0] > 0 && webAssignments[0] <= 21) {
    int paramIndex = webAssignments[0] - 1;
    parameters[paramIndex].value = ir1Value;
    dmxValues[parameters[paramIndex].dmxChannel - 1] = ir1Value;
  }
  
  // IR2
  if (webAssignments[1] > 0 && webAssignments[1] <= 21) {
    int paramIndex = webAssignments[1] - 1;
    parameters[paramIndex].value = ir2Value;
    dmxValues[parameters[paramIndex].dmxChannel - 1] = ir2Value;
  }
  
  // Fader2
  if (webAssignments[2] > 0 && webAssignments[2] <= 21) {
    int paramIndex = webAssignments[2] - 1;
    parameters[paramIndex].value = fader2Value;
    dmxValues[parameters[paramIndex].dmxChannel - 1] = fader2Value;
  }
  
  // Fader3
  if (webAssignments[3] > 0 && webAssignments[3] <= 21) {
    int paramIndex = webAssignments[3] - 1;
    parameters[paramIndex].value = fader3Value;
    dmxValues[parameters[paramIndex].dmxChannel - 1] = fader3Value;
  }
  
  // Appliquer l'octave web après la mise à jour des contrôles physiques
  applyWebOctave();
}

